Repository: florianpetiot/polyleaks
Catalog: lib/l10n/app_*.arb
Languages: fr

# slotRecherche
source: Searching...
fr: Recherche...

# slotTrouve1
source: Found
fr: Trouvé

# slotTrouve2
source: Connect
fr: Se connecter

# slotTrouve3
source: Ignore this time
fr: Ignorer cette fois

# slotTrouve4
source: has been added to the temporary blacklist.
fr: a été ajouté à la liste noire temporaire.

# slotConnecte1
source: Now
fr: Maintenant

# slotConnecte2
source: Details
fr: Détails

# slotPerduDate
source: Seen on {mois}/{jour}/{annee}
fr: Vu le {jour}/{mois}/{annee}

# slotPerduHeures
source: Seen {heure}h ago
fr: Vu il y a {heure}h

# slotPerduMinutes
source: Seen {minute}min ago
fr: Vu il y a {minute}min

# slotPerduSecondes
source: Seen {seconde}s ago
fr: Vu il y a {seconde}s

# accueilComparateur
source: Leaks detector
fr: Comparateur

# accueilAnalyse1
source: Connect to two sensors to get started.
fr: Connectez-vous à deux capteurs pour commencer.

# accueilAnalyse2
source: A leak has been detected!
fr: Une fuite a été détectée !

# accueilAnalyse3
source: No leak detected.
fr: Aucune fuite détectée.

# accueilBlacklistBouton
source: Reset the blacklist
fr: Réinitialiser la blacklist

# accueilWarning1
source: To be able to start a scan, please grant access to location and Bluetooth.
fr: Pour pouvoir démarrer un scan, veuillez accorder l'accès à la localisation et au Bluetooth.

# accueilWarningBouton
source: Grant access
fr: Autoriser

# accueilWarning2
source: The access request has been denied.
fr: La demande d'accès a été refusée.

# erreur0Titre
source: Unknown error
fr: Erreur inconnue

# erreur0Description
source: An unknown error has occurred.
fr: Une erreur inconnue s'est produite.

# erreur1Titre
source: Sensor not found
fr: Capteur introuvable

# erreur1Description
source: The sensor you are trying to reach is no longer nearby. Please move closer and try again.
fr: Le capteur que vous essayez de joindre n'est plus à proximité. Veuillez vous en rapprocher puis réessayez.

# erreur2Titre
source: Sensor not initialised
fr: Capteur non initialisé

# erreur2Description
source: The sensor you are trying to reach has not been initialised. Please go to the 'More' section to initialise it and then try again.
fr: Le capteur que vous essayez de joindre n'a pas été initialisé. Veuillez vous rendre dans la partie 'Plus' pour l'initialiser puis réessayez.

# erreur3Titre
source: Permission required
fr: Permission requise

# erreur3Description
source: In order for this application to work properly, please grant permission to access the GPS location.
fr: Pour le bon fonctionnement de cette application, veuillez accorder la permission d'accès à la localisation GPS.

# erreur4Titre
source: Permission required
fr: Permission requise

# erreur4Description
source: You have permanently denied permission to access the GPS location. For this application to work properly, please grant permission to access GPS location in your device settings.
fr: Vous avez refusé la permission d'accès à la localisation GPS de manière définitive. Pour le bon fonctionnement de cette application, veuillez accorder la permission d'accès à la localisation GPS dans les paramètres de votre appareil.

# erreur4Bouton1
source: Go to settings
fr: Aller aux paramètres

# erreur4Bouton2
source: Ingnore
fr: Ignorer

# erreur5Titre
source: Bluetooth disabled
fr: Bluetooth désactivé

# erreur5Description
source: For this application to work properly, please enabled Bluetooth on your device.
fr: Pour le bon fonctionnement de cette application, veuillez activer le Bluetooth de votre appareil.

# pageHistorique
source: History
fr: Historique

# bs1
source: Measure
fr: Mesure

# bs2
source: Last connection
fr: Dernière connexion

# bs3
source: Initialisation date
fr: Date d'installation

# bs4
source: Open in Google Maps
fr: Ouvrir dans Google Maps

# bs5
source: Comparator slots
fr: Emplacements du comparateur

# bs6
source: Put in slot
fr: Mettre dans l'emplacement

# bs8
source: Estimate from time since last connection.
fr: Estimé grâce au temps passé depuis la dernière connexion.

# liste1
source: Battery
fr: Batterie

# liste2
source: Location
fr: Localisation

# liste3
source: Numerology
fr: Numérologique

# plus1
source: Language
fr: Langue

# plus2
source: Dark mode
fr: Mode sombre

# plus4
source: Initialise a sensor
fr: Initialiser un capteur

# aPropos0
source: Aboout PolyLeaks
fr: À propos de PolyLeaks

# aPropos1
source: Water leaks in pipes are a major problem in water distribution in France. In fact, 20% of the clean water produced is lost through leaks. This loss represents 14 million Olympic-sized swimming pools filled every year. To find a solution to this problem, we have created an innovative leak detection system: PolyLeaks.
fr: Les fuites d'eau dans les canalisations représentent un problème considérable dans la distribution d'eau en France. En effet, 20% de l'eau propre produite est perdue à cause des fuites. Cette perte représente 14 millions de piscines olympiques remplies chaque année. Afin de trouver une solution à cette problématique nous avons créé un système de détection de fuite innovant : PolyLeaks.

# aPropos2
source: PolyLeaks is a system that uses a network of sensors to detect leaks in pipes. These sensors are placed at regular intervals along the pipes and are connected to a central computer. The computer analyzes the data collected by the sensors and alerts the operator in case of a leak. This allows the operator to quickly locate and repair the leak, reducing water loss and saving money.
fr: PolyLeaks est un projet ambitieux conçu par une équipe de 12 étudiants de deuxième année de classe préparatoire aux écoles d'ingénieur Polytech (PeiP) à Nantes. L'objectif est de limiter les pertes d'eau dues aux fuites dans les canalisations, alignant ainsi notre initiative avec les Objectifs de Développement Durable (ODD) de l'ONU. On s'est focalisé sur la gestion durable de l'eau (ODD n°6), les villes et communautés durables (ODD n°11) et la consommation et production responsable (ODD n°12).

# aPropos3
source: Firstly, we thought about how to design an innovative leak detection system.
fr: Premièrement, on a réfléchi à comment concevoir un système innovant de détection de fuite.

# aPropos4
source: Secondly, to carry out our project we split the team into several divisions to optimise our working time and skills.
fr: Deuxièmement, pour réaliser notre projet nous avons séparé l'équipe en plusieurs pôles afin d'optimiser notre temps de travail et nos compétences.

# aPropos5
source: Thirdly, we carried out a literature review on the various existing leak detection methods. We also drew up a list of the advantages and disadvantages of each method.
fr: Troisièmement, nous avons réalisé une étude bibliographique sur les différentes méthodes existantes de détection de fuite. On a aussi établi une liste des avantages et des inconvénients de chaque méthode.

# aPropos6
source: In conclusion, after several months of research, we came up with an innovative solution consisting of a coupling ring fitted with a Hall-effect sensor. This method enabled leaks to be detected almost instantaneously by measuring the volume flow in the pipe.
fr: En conclusion, après plusieurs mois de recherche, nous avons trouvé une solution innovante qui consiste en une bague de raccord équipée d'un capteur à effet Hall. Cette méthode a permis la détection quasi-instantanée des fuites en mesurant le débit volumique dans la canalisation.

# aPropos7
source: Our team even managed the challenge of 3D printing the digital design of the ring and even designing a mobile application!
fr: Notre équipe a même réussi le challenge d'imprimer en 3D la conception numérique de la bague et même concevoir une application mobile !

# initCapteursSetUp
source: Request for permissions in progress...
fr: Demande des autorisations en cours...

# initCapteursTitre
source: Sensors initialisation
fr: Initialisation des capteurs

# initCapteurs1
source: Placement of the ring
fr: Placement de la bague

# initCapteurs2
source: Battery connection
fr: Connexion de la batterie

# initCapteurs3
source: Sensor initialisation
fr: Initialisation du capteur

# initCapteurs3Titre
source: Searching for sensors...
fr: Recheche de capteurs en cours...

# initCapteurs4
source: Do not move your phone during initialisation.
fr: Ne bougez pas votre téléphone pendant l'initialisation.

# initCapteurs4Bouton
source: Start
fr: Démarrer

# initCapteurs4GPS1
source: Obtaining the location...
fr: Obtention de la localisation...

# initCapteurs4GPS2
source: Location obtained.
fr: Localisation obtenue.

# initCapteurs4GPS3
source: Permissions denied.
fr: Autorisations refusées.

# initCapteurs4Transmission1
source: Transmission in progress...
fr: Transmission des données...

# initCapteurs4Transmission2
source: Transmission completed.
fr: Transmission des données réussie.

# initCapteurs4Transmission3
source: Connection failed.
fr: Echec de la connexion.

# initCapteurs4Transmission4
source: Sensor already initialised.
fr: Capteur déjà initialisé.

# initCapteursStep1
source: Next
fr: Continuer

# initCapteursStep2
source: Previous
fr: Précédent
